alefragnani.project-manager
catppuccin.catppuccin-vsc
enkia.tokyo-night
esbenp.prettier-vscode
fill-labs.dependi
github.copilot
github.copilot-chat
jdinhlife.gruvbox
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
pkief.material-icon-theme
platformio.platformio-ide
rust-lang.rust-analyzer
tamasfe.even-better-toml
usernamehw.errorlens
